# это однострочный комментарий
# "Ctrl + /" - сочетание клавиш для однострочного комментария

# много
# строчный
# код

'''
многострочный 
комментарий
'''

"""
это тоже
мнострочный 
комментарий
"""

# PEP8

# *** Переменные ***

# snake_case (змеиная_нотация)
var_1 = 10
var_2 = 5

result = var_1 + var_2

# print(result)

# camelCase (верблюжаяНотация)
myNumVar = 200

# константные переменные (константы)
CONST_VAR = 1000

# встроенная функция вывода в терминал
# print(myNumVar)
# print(CONST_VAR)

# print(var_1, var_2, myNumVar)

# встроенная функция ввода из терминала
in_1 = input("Введите число: ")

print(in_1)

# небольшой калькулятор
in_1 = input("Введите 1 число: ")
in_2 = input("Введите 2 число: ")

# конкатинация строк
res = in_1 + in_2

# конвертация типов данных
# str -> int
# a = "100"
# a = int(a)

# арефмитическое сложение
res = int(in_1) + int(in_2)

print(res)